load_tests/find_contacts.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 200
  variables:
    name: 'murilo'
    page: 1
    perPage: 100

scenarios:
  - name: 'Find all contacts'
    flow:
      - get:
          url: '/contacts/name/{{name}}?page={{page}}&perPage={{perPage}}'
          expect:
            - statusCode: 200